Tekla Open API Reference for Tekla Structures 2025
Plugin.TrySetAttribute Method (String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool TrySetAttribute(
	string FieldName,
	int fieldValue
)
Public Function TrySetAttribute (
	FieldName As String,
	fieldValue As Integer
) As Boolean
Parameters
FieldName
Type: System.String
The name of the attribute to set.
fieldValue
Type: System.Int32
The value for the attribute.
Return Value
Type: Boolean
True on success. Otherwise, false.
See Also
Reference
Plugin Class
TrySetAttribute Overload
Tekla.Structures.Drawing Namespace